---
kind: other
id: AllMembers.T:Autodesk.Revit.Creation.AreaCreationData
source: html/8a6c758d-94ed-e07c-cce6-294043426bf2.htm
---
# AreaCreationData Members

Initializes a new instance of the AreaCreationData class